.. _rut_userguide:

Chile RUT/RUN Numbers
=====================

Introduction
------------

The function :func:`clean_cl_rut() <dataprep.clean.clean_cl_rut.clean_cl_rut>` cleans a column containing Chile RUT/RUN number (RUT) strings, and standardizes them in a given format. The function :func:`validate_cl_rut() <dataprep.clean.clean_cl_rut.validate_cl_rut>` validates either a single RUT strings, a column of RUT strings or a DataFrame of RUT strings, returning `True` if the value is valid, and `False` otherwise.

RUT strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "125319092"
* `standard`: RUT strings with proper whitespace in the proper places, like "12.531.909-2"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_cl_rut()` and `validate_cl_rut()`.

### An example dataset containing RUT strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "rut": [
            "125319092",
            "76086A28-5",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              rut                                           address
0       125319092                                     123 Pine Ave.
1      76086A28-5                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_cl_rut`

By default, `clean_cl_rut` will clean rut strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_cl_rut
clean_cl_rut(df, column = "rut")

,rut,address,rut_clean
0,125319092,123 Pine Ave.,12.531.909-2
1,76086A28-5,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_cl_rut(df, column = "rut", output_format="standard")

,rut,address,rut_clean
0,125319092,123 Pine Ave.,12.531.909-2
1,76086A28-5,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_cl_rut(df, column = "rut", output_format="compact")

              rut                                           address  rut_clean
0       125319092                                     123 Pine Ave.  125319092
1      76086A28-5                                           main st        NaN
2     51824753556                      1234 west main heights 57033        NaN
3  51 824 753 556                    apt 1 789 s maple rd manhattan        NaN
4           hello                robie house, 789 north main street        NaN
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
6            NULL                                             hello        NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned RUT strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_cl_rut(df, column="rut", inplace=True)

      rut_clean                                           address
0  12.531.909-2                                     123 Pine Ave.
1           NaN                                           main st
2           NaN                      1234 west main heights 57033
3           NaN                    apt 1 789 s maple rd manhattan
4           NaN                robie house, 789 north main street
5           NaN  (staples center) 1111 S Figueroa St, Los Angeles
6           NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_cl_rut(df, "rut", errors="coerce")

,rut,address,rut_clean
0,125319092,123 Pine Ave.,12.531.909-2
1,76086A28-5,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_cl_rut(df, "rut", errors="ignore")

,rut,address,rut_clean
0,125319092,123 Pine Ave.,12.531.909-2
1,76086A28-5,main st,76086A28-5
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_cl_rut()`

`validate_cl_rut()` returns `True` when the input is a valid RUT. Otherwise it returns `False`.

The input of `validate_cl_rut()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_cl_rut()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_cl_rut()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_cl_rut
print(validate_cl_rut("125319092"))
print(validate_cl_rut("76086A28-5"))
print(validate_cl_rut("51824753556"))
print(validate_cl_rut("51 824 753 556"))
print(validate_cl_rut("hello"))
print(validate_cl_rut(np.nan))
print(validate_cl_rut("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_cl_rut(df["rut"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: rut, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_cl_rut(df, column="rut")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: rut, dtype: bool

### Only DataFrame

In [11]:
validate_cl_rut(df)

     rut  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False